system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
   =========                 |
   \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
    \\    /   O peration     | Website:  https://openfoam.org
     \\  /    A nd           | Version:  13
      \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters     1;

xmin                0;
ymin                0;
zmin                0;
xmax                1;
ymax                1;
zmax                1;

xcells              10;
ycells              10;
zcells              1;

/*
deltax              0.0075;
xcells              #calc "round(($xmax-$xmin)/$deltax)";
ycells              $xcells;
*/

vertices
(
    ($xmin $ymin $zmin)
    ($xmax $ymin $zmin)
    ($xmax $ymax $zmin)
    ($xmin $ymax $zmin)
    ($xmin $ymin $zmax)
    ($xmax $ymin $zmax)
    ($xmax $ymax $zmax)
    ($xmin $ymax $zmax)
);

blocks 
(
    hex (0 1 2 3 4 5 6 7) ($xcells $ycells $zcells) simpleGrading (1 1 1)
);

edges
(
    //arc 0 1 (0.5 -0.1 0)
    //arc 4 5 (0.5 -0.1 1)
);

boundary
(
    movingWall
    {
        type    wall;
        faces
        (
            (3 7 6 2)
        );
    }

    fixedWalls
    {
        type    wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (0 1 5 4)
        );
    }

    frontAndBack
    {
        type    empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
    //(interface1 interface2)
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //