system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
   =========                 |
   \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
    \\    /   O peration     | Website:  https://openfoam.org
     \\  /    A nd           | Version:  13
      \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format              ascii;
    class               dictionary;
    object              fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U).*"                 //"(U|k|epsilon|omega|R|nuTilda)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0;
        minIter         2;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    consistent          yes;

    nOuterCorrectors            1;
    nCorrectors                 1;
    nNonOrthogonalCorrectors    1;

    pRefCell            0;
    pRefValue           0;
}

relaxationFactors
{
    fields
    {
        ".*"            0.9;
    }
    
    equations
    {
        ".*"            0.9;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //